const timelineContents = [
  {
    header: '2022 — 2021',
    body: [
      {
        heading: 'Next.js を使ってこのサイトを制作',
        date: '2022-12',
        description:
          'JavaScript の学習を進める中で、Next.js や React などのモダンなフロントエンド開発に興味を持つ。ちょうどブログを始めたかったので、 Next.js のチュートリアルに沿って本サイトを制作。現在も機能やコンテンツを追加中で、その過程はブログで公開中。',
      },
      {
        heading: 'JavaScript を集中的に学習する',
        date: '2022-10',
        description:
          'JavaScript には苦手意識があったが、フロントエンド開発においては必須科目だと感じたので、集中的に学習。その結果、JavaScript のことが好きになる。ちなみに、JavaScript の学習には <a href="https://learnjavascript.online/" target="_blank" rel="noreferrer noopener">Learn JavaScript</a> と <a href="https://developer.mozilla.org/en-US/" target="_blank" rel="noreferrer noopener">MDN Web Docs</a> を主に使用。',
      },
      {
        heading: 'WordPress を使った受託制作を担う',
        date: '2021-03',
        description:
          '打ち合わせの同行、デザイン、コーディングという受託制作の一連の流れを担う。また、昔に写真撮影を学んでいたおかげで、ウェブサイトに掲載する写真やちょっとした動画の撮影も担当。できることが増えて、ますます仕事が楽しくなる。',
        connector: false,
      },
    ],
  },
  {
    header: '2020 — 2018',
    body: [
      {
        heading: '自社関連のサイトで試行錯誤し WordPress を学ぶ',
        date: '2020-04',
        description:
          '経験や知識が浅いため、自社関連のサイトで色々と試行錯誤する。ウェブの世界は、知れば知るほど知りたいことが増え、それが楽しく、「ずっとウェブの仕事をしていたい！」と思うようになる。',
      },
      {
        heading: '社内のウェブ制作担当がいなくなる',
        date: '2019-10',
        description:
          '諸事情により、主にウェブ制作を担当していた者が離脱。そのため業務を諸々引き継ぐ必要があり、当時はバタバタしたが、自身にとってはよい経験となった。',
      },
      {
        heading: 'ウェブ制作のアシスタントを担う',
        date: '2018-10',
        description:
          'この頃より、ウェブの仕事が増える。学生時代にウェブ制作をかじっていたので、下層ページのデザインや、ちょっとしたコードの修正を任されるように。ウェブ制作の楽しさを思い出す。',
      },
      {
        heading: 'グラフィックデザイナー見習いに',
        date: '2018-04',
        description:
          '現在の会社に転職。既存のカタログの修正や、定期イベントのポスター発注などをしながら、 Illustator や Photoshop などの使い方を学ぶ。それと同時に、好きなことを仕事にできる喜びを噛み締める。',
      },
      {
        heading: 'グラフィックデザイナーになると決意',
        date: '2018-01',
        description:
          '今ままで「自身がやりたいことだと思うこと」に色々と手を出してきた。そのひとつに写真がある。しかし「自身がやりたいこと」とは「自身から湧いて出るものではなく、他者の存在があってこそ生まれるもの」なのだと気づく。そしてそれは「写真」ではなく、「グラフィックデザイン」だった。',
        connector: false,
      },
    ],
  },
  {
    header: '2017 — 2015',
    body: [
      {
        heading: 'グラフィックデザインに目覚める',
        date: '2017-12',
        description:
          '学生時代に Illustrator などを触っていたことがきっかけで、当時働いていたお店のフライヤー作成を依頼される。そして、その流れで商品のポップを作ったり、カフェのメニューを作ったり、徐々に任されることが増えていく。人に求められて何かを作ることの喜びを知る。',
      },
      {
        heading: '写真のグループ展で特別賞をもらう',
        date: '2017-10',
        description:
          '当時は写真に注力しており、グループ展に展示もしていた。その際に、ギャラリーのオーナーから特別賞をもらう。このときの被写体が今の奥さんで、僕自身もこの写真を気に入っている。撮影から現像、プリント、額装までを自身で行い、作り上げていく感覚がとても楽しかった。',
      },
      {
        heading: '部屋中の窓をダンボールで閉ざす',
        date: '2016-07',
        description:
          '現像を自身で行おうと、窓をダンボールで閉ざし、自室を暗室化。引き伸ばし機も購入し、自室でプリントも行う。',
      },
      {
        heading: '大学を中退',
        date: '2015-03',
        description:
          '2年ほど休学した挙げ句、結局中退。写真が楽しく、大学に行く意味を見失う。この辺りで、バイトをしていた雑貨屋兼カフェ兼本屋にて契約社員として働き始める。',
        connector: false,
      },
    ],
  },
  {
    header: '2014 — 2009',
    body: [
      {
        heading: '写真に取り憑かれる',
        date: '2014-04',
        description:
          'この頃は写真にハマり、休日はもちろん、バイトの休憩中も出勤時も帰宅時も写真を撮り続ける。使える時間はほぼ写真に使い、結果1日1食となり、体重が40キロ台になったのはいい思い出。この頃から雑貨屋兼カフェ兼本屋でバイトを始める。',
      },
      {
        heading: '卒業論文を提出するも休学',
        date: '2013-03',
        description:
          '卒業論文を提出したものの、就職先などが決まっておらず、「まだ学生でいた方がメリットがあるかも」と考え休学。',
      },
      {
        heading: 'WordPress と戦う',
        date: '2012-08',
        description:
          'ウェブ制作を独学し、学んだことを試してみたく、当時学生が立ち上げたウェブ制作系の会社にインターンとして参加。 WordPress を使ったメディアサイトの立ち上げを担当。このとき、わからないことだらけで苦しみもあったが、なんとか公開することができ、誰かと何かを成し遂げる喜びを知る。',
      },
      {
        heading: '就活をやめる',
        date: '2012-06',
        description:
          'ポテンシャル採用的な感じが性に合わず就活をやめる。技術や能力を身につけて、それを売りに就活をする方が自分には合っていると感じた。というわけで、ウェブ制作をきちんと学ぶため HTML や CSS の独学をスタート。',
      },
      {
        heading: 'CSS と出会う',
        date: '2012-04',
        description:
          '就活の学びを記録しようとブログを書いていたが、書いてるうちにブログの見た目が気になり始める。そこで、CSS というものを書けばカスタマイズできることを知る。自分が書いたコードのようなものが、画面に反映されるだけで楽しかった。そしてそのままウェブ制作に関心を持ち始める。',
      },
      {
        heading: '我先にと就活を始める',
        date: '2012-01',
        description:
          '大学生活は自堕落だったので就活はしっかりやるぞ！と、意気揚々と就活スタート。色々と調べ、就活の選考解禁前でも、ベンチャー企業なら採用活動を行っていることを知り、とにかく話を聞きまくった。このとき、ウェブ系企業に何かキラキラしたものを感じた。',
      },
      {
        heading: '何も考えず大学に入学',
        date: '2009-04',
        description:
          '特に目標もなく「家から通えて、名前もそこそこ知られているから」というダメダメな理由で近畿大学に入学。経済学部だったが、好きな授業は英語のリーディング。このときのおかげで、英語を読むことへの苦手意識は薄くなった。ただ、スピーキングとリスニングは苦手。',
        connector: false,
      },
    ],
  },
  {
    header: '1990',
    body: [
      {
        heading: '生まれる',
        date: '1990-10-11',
        description: '',
        connector: false,
      },
    ],
  },
];

export default timelineContents;
