const aboutContents = [
  {
    header: '2022 — 2021',
    body: [
      {
        heading: 'モダンなフロントエンド開発に興味を持つ',
        date: '2022-12',
        description:
          'JavaScript の学習を進める中で、 Next.js や React などのモダンなフロントエンド開発に興味を持つ。<br />最近は Jamstackなサイト制作にも関心あり。その学習のためにこのサイトも作成。',
      },
      {
        heading: 'JavaScript の学習を開始',
        date: '2022-10',
        description:
          'フロントエンドにおいて JavaScript は必須科目だと感じ、その学習を開始。ちなみに、 JavaScript の学習には <a href="https://learnjavascript.online/" target="_blank" rel="noreferrer noopener">Learn JavaScript</a> と <a href="https://developer.mozilla.org/en-US/" target="_blank" rel="noreferrer noopener">MDN Web Docs</a> を主に使用。',
      },
      {
        heading: 'WordPress を使った受託制作を担えるように',
        date: '2021-03',
        description:
          '打ち合わせに同行し、デザインをし、コーディングをするという受託制作の一連の流れを経験。また、昔に写真撮影を学んでいたおかげで、ウェブサイトに掲載する写真やちょっとした動画の撮影も担当。できることが増えていき、ますます仕事が楽しくなる。',
        connector: false,
      },
    ],
  },
  {
    header: '2020 — 2018',
    body: [
      {
        heading: '自社関連のサイトで試行錯誤し WordPress を学ぶ',
        date: '2020-04',
        description:
          '経験や知識が浅いため、自社関連のサイトで色々と試行錯誤する。ウェブの世界は、知れば知るほど知りたいことが増え、それが楽しく、「ずっとウェブの仕事をしていたい！」と思うようになる。',
      },
      {
        heading: '社内のウェブ制作担当がいなくなる',
        date: '2019-10',
        description:
          '諸事情により、主にウェブ制作を担当していた者が会社からいなくなる。その方が行っていた業務を諸々引き継ぐ必要があり、当時は色々とバタバタしたが、よい経験となった。',
      },
      {
        heading: 'ウェブ制作のアシスタント的な役割を担う',
        date: '2018-10',
        description:
          'この頃より、ウェブの仕事が増える。学生時代にウェブ制作をかじっていたので、下層ページのデザインや、ちょっとしたコードの修正を任されるように。ウェブ制作の楽しさを思い出す。',
      },
      {
        heading: 'グラフィックデザイナー見習いとして業務を開始',
        date: '2018-04',
        description:
          '現在の会社に転職。既存のカタログの修正や、定期イベントのポスター発注などをしながら、 Illustator や Photoshop などの使い方を学ぶ。それと同時に、好きなことを仕事にできる喜びを噛み締める。',
      },
      {
        heading: 'グラフィックデザインの仕事をすると決意',
        date: '2018-01',
        description:
          '今ままでは「自身がやりたいことだと思うこと」に色々と手を出してきた。そのひとつに写真がある。しかし、「自身がやりたいこと」とは「自身から湧いて出るものではなく、他人ありきで生まれるもの」なのだと気づく。そしてそれは「写真」ではなく、「グラフィックデザイン」だった。',
        connector: false,
      },
    ],
  },
  {
    header: '2017 — 2015',
    body: [
      {
        heading: 'グラフィックデザインに目覚める',
        date: '2017-12',
        description:
          '学生時代に Illustrator などを触っていたことがきっかけで、当時働いていたお店のフライヤー作成を依頼される。そして、その流れで商品のポップを作ったり、カフェのメニューを作ったり、徐々に任されることが増えていく。人に求められて何かを作ることの喜びを知る。',
      },
      {
        heading: '写真のグループ展で、特別賞に選ばれる',
        date: '2017-10',
        description:
          'と言っても厳正な審査によるものではなく、ギャラリー主宰の独断によるものだが。このときの被写体が今の奥さんで、僕自身も特に気に入っている写真。撮影から現像、プリント、額装までを自身で行い、作り上げていく感覚がとても楽しかった。',
      },
      {
        heading: '部屋中の窓をダンボールで閉ざす',
        date: '2016-07',
        description:
          '現像を自身で行おうと、窓をダンボールで閉ざし、自室を暗室化。引き伸ばし機も購入し、自室でプリントも行う。',
      },
      {
        heading: '大学を中退',
        date: '2015-03',
        description:
          '2年ほど休学した挙げ句、結局中退。写真が楽しく、大学に行く意味を見失う。この辺りで、バイトをしていた雑貨屋兼カフェ兼本屋にて契約社員として働き始める。',
        connector: false,
      },
    ],
  },
  {
    header: '2014 — 2009',
    body: [
      {
        heading: '写真に取り憑かれる',
        date: '2014-04',
        description:
          'この頃は写真にハマり、休日はもちろん、バイトの休憩中も出勤時も帰宅時も写真を撮り続ける。写真を撮ることにハマり、1日1食になり、体重が40キロ台にまで下がったのは、いい思い出。この頃から雑貨屋兼カフェ兼本屋でバイトを始める。',
      },
      {
        heading: '卒業論文を提出するも休学する',
        date: '2013-03',
        description:
          'ベンチャー企業の話をたくさん聞いていく中で、ウェブ系の企業の存在を知る。このとき就活ブログも書いていて、ブログのカスタマイズにハマり、その過程でウェブ制作に関心を持つ。',
      },
      {
        heading: '学生ベンチャー企業にインターンとして参加',
        date: '2012-08',
        description:
          '実務的なウェブ制作を行いたく、当時学生が立ち上げたウェブ制作系の会社にインターンとして参加。 WordPress を使ったメディアサイトの立ち上げを担当。このとき、わからないことだらけで苦しみもあったが、誰かと何かを成し遂げる喜びを知る。',
      },
      {
        heading: '就活解禁後、間もなく就活をやめる',
        date: '2012-06',
        description:
          '新卒採用のポテンシャル採用的な部分に疑問を感じ、就活を止める。自身の技術や能力を売りに、就活をする方が性に合っていると感じた。というわけで、ウェブ制作をきちんと学ぶため HTML, CSS, WordPress を独学開始。',
      },
      {
        heading: 'ウェブ系企業との出会い',
        date: '2012-04',
        description:
          'ベンチャー企業の話をたくさん聞いていく中で、ウェブ系の企業の存在を知る。このとき就活ブログも書いていて、ブログのカスタマイズにハマり、その過程でウェブ制作に関心を持つ。',
      },
      {
        heading: '我先にと就活を始める',
        date: '2012-01',
        description:
          '大学生活は自堕落だったので就活はしっかりやるぞ！と、意気揚々と就活スタート。色々と調べ、就活の選考解禁前でも、ベンチャー企業なら採用活動を行っていることを知り、とにかく話を聞きまくった。',
      },
      {
        heading: '何も考えず大学に入学',
        date: '2009-04',
        description:
          '特に目標もなく「家から通えて、名前もそこそこ知られているから」というダメダメな理由で近畿大学に入学。経済学部だったが、好きな授業は英語のリーディング。このときのおかげで、英語を読むことへの苦手意識は薄くなった。ただ、スピーキングとリスニングは苦手。',
        connector: false,
      },
    ],
  },
];

export default aboutContents;
